---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution
source: html/75aa8f4d-b301-6d8d-9cf2-ca3718e7346d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution Property

"Analytical Space Resolution"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution { get; }
```